//— Представьте что вы — знаменитость — Фанаты, независимо друг от друга, кладут очень много писем вам в почтовый ящик — Создайте слайс строк, где каждая строка — это письмо от фаната — Каждый фанат — это отдельная горутина, которая много раз пишет вам новое письмо (добавляет новый элемент в слайс) — Запустите программу и оцените, если ли в представленной задаче гонка данных или нет — Как можно отловить гонку данных? — Если гонка данных есть, избавьтесь от неё, после чего проведите повторные проверки

package main

import (
	"fmt"
	"strconv"
	"sync"
)

func main() {

	/*
		//без примитивов синхронизации

		var fanMails []string

		wg := &sync.WaitGroup{}

		for f := range 100 {
			wg.Go(func() {
				for i := range 100 {
					fanMails = append(fanMails, "привет я фанат "+strconv.Itoa(f)+" и это мое "+strconv.Itoa(i)+" письмо тебе!")
				}
			})

		}

		wg.Wait()

		fmt.Println("у меня целых ", len(fanMails), " писем!")
		// но кажется некоторые не дошли ))
		// проверяем через флаг  -race и действительно у нас гонка

	*/

	var fanMails []string

	wg := &sync.WaitGroup{}

	mtx := sync.Mutex{}

	for f := range 100 {
		wg.Go(func() {
			for i := range 100 {
				mtx.Lock()
				fanMails = append(fanMails, "привет я фанат "+strconv.Itoa(f)+" и это мое "+strconv.Itoa(i)+" письмо тебе!")
				mtx.Unlock()
			}
		})

	}

	wg.Wait()

	fmt.Println("у меня целых ", len(fanMails), " писем!")
	// и кажется все дошли ))
	// флажок -race ничего не показал

}
