/*
— Опишите функцию, которая принимает целое число (свой номер), после чего 5 раз, с интервалом в одну секунду, выводит на экран: — "Я горутина N, делаю вывод на экран в X раз", где N - номер горутины, а X - номер итерации — Запустите 3 горутины, в каждой горутине запущена вышеописанная функция — Посмотрите на вывод в консоли, объясните себе его, оцените, насколько этот вывод соответсвует вашим ожиданиям
*/

package main

import (
	"fmt"
	"time"
)

func test(n int) {
	for i := range 5 {
		fmt.Println("я горутина - ", n, "делаю вывод на экран", i, "раз")
		time.Sleep(1 * time.Second)
	}
}

func main() {
	for n := range 3 {
		go test(n)
	}

	time.Sleep(6 * time.Second)
}
