/*
 Запустите 2 горутины через анонимные функции — Каждая горутина принимает свой отдельный канал, и в самом начале своего выполнения спит случайное количество времени (100ms/200ms/300ms/400ms/500ms/600ms/700ms/800ms/900ms/1000ms), это сгенерированное количество времени нужно вывести на экран, после чего горутина пишет случайное значение в переданный канал. — После запуска этих двух горутин, main горутина засыпает на 500ms, после чего доходит до блока select, в котором ожидаются значения из двух каналов, переданных в горутины, и секция default. Каждая секция, будь то вычитывание значения из канала или же секция default, должны выводить на экран информацию о том, какая именно секция отработала и какие значения приняла (если вообще приняла). — Оценить консольный вывод, объяснить его самому себе, сравнить с ожиданиями. — Поиграться с временен засыпания горутин, попробовать поставить фиксированное время сна до записи в канал, увидеть как это влияет на результат и объяснить себе почему.
*/

package main

import (
	"fmt"
	"math/rand"
	"time"
)

func main() {
	ch1 := make(chan int)
	ch2 := make(chan int)

	go func() {
		n := rand.Intn(10)
		n++
		fmt.Println("я горутина 1 и заснула на ", n*100, "миллисекунд")
		time.Sleep(time.Duration(n*100) * time.Millisecond)

		ch1 <- rand.Intn(100)
	}()

	go func() {
		n := rand.Intn(10)
		n++
		fmt.Println("я горутина 2 и заснула на ", n*100, "миллисекунд")
		time.Sleep(time.Duration(n*100) * time.Millisecond)

		ch2 <- rand.Intn(100)
	}()

	time.Sleep(500 * time.Millisecond)

	select {
	case n1 := <-ch1:
		{
			fmt.Println("прочитался первый канал с числом: ", n1)
		}
	case n2 := <-ch2:
		{
			fmt.Println("прочитался второй канал с числом: ", n2)
		}
	default:
		{
			fmt.Println("ничего не прочиталось")
		}
	}
}
